Revit 2021.1 API
Document.SaveAsCloudModel Method (String, String)
 Saves current nonworkshared model as a cloud model in BIM 360.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2019.2
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a later version of Revit. We suggest you use the overload method with two extra BIM 360 account Id and project Id arguments.")]
public void SaveAsCloudModel(
	string folderId,
	string modelName
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a later version of Revit. We suggest you use the overload method with two extra BIM 360 account Id and project Id arguments.")> _
Public Sub SaveAsCloudModel ( _
	folderId As String, _
	modelName As String _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a later version of Revit. We suggest you use the overload method with two extra BIM 360 account Id and project Id arguments.")]
public:
void SaveAsCloudModel(
	String^ folderId,
	String^ modelName
)
Parameters
folderId
Type: System.String
 Folder identity in BIM 360 to save the model.
modelName
Type: System.String
 Model name in BIM 360 to save the model.
Remarks
 Assumes that user is currently signed in BIM 360 and has access to Autodesk cloud services. This operation will create a model on cloud and then create a local cache of the cloud model. This method cannot be used when current document is already in cloud.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  folderId is an empty string. -or- modelName is an empty string. -or- modelName cannot include prohibited characters.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException |  SaveAs may not be called during dynamic update.
Autodesk.Revit.Exceptions.InvalidOperationException |  The document does not allow worksharing to be enabled. -or- This Document is a workshared document. -or- Saving is not allowed in the current application mode. -or- This Document has is in an edit mode or is in family mode. -or- This Document is not a primary document, it is a linked document. -or- SaveAs is temporarily disabled. -or- This Document is cloud model, cannot be saved as cloud model. -or- There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Autodesk.Revit.Exceptions.RevitServerCommunicationException |  Could be for any of the reasons related to network.
Autodesk.Revit.Exceptions.RevitServerInternalException |  Failed due to there is a model in cloud under the project with that name. -or- Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException |  User is not signed in with Autodesk id.
Autodesk.Revit.Exceptions.RevitServerUnauthorizedException |  User is not authorized to access the specified cloud project.
[!:Autodesk::Revit::Exceptions::RevitServerUnauthorizedNativeException] |  You do not have cloud model entitlement to access this resource in cloud
[!:Autodesk::Revit::Exceptions::UnauthenticatedUserException] |  User is not authenticated to access the specified cloud project.
See Also
Document Class
SaveAsCloudModel Overload
Autodesk.Revit.DB Namespace